

# -------------------------------------------------------------

# Метод произведения чисел
def Product(Arr): 
    
    # Проверка типа данных
    if(type([]) != type(Arr)): return 0

    S = 1
    for I in Arr: S *= I 
    return S

# -------------------------------------------------------------

# Главный метод
def main():
    
    print(" >> Произведение чисел от 10 до 100 включительо.")

    # Создаём массив чисел от 10 до 100 включительо
    ARR = [I for I in range(10,100 + 1)]

    print("Пример :", Product(ARR))  

# -------------------------------------------------------------
if __name__ == "__main__": main()
# -------------------------------------------------------------

