
# -------------------------------------------------------------

# Метод подсчёта прироста
def Bank(Money,Percent): return (Money / 100) * Percent

# -------------------------------------------------------------

# Главный метод
def main():
    
    print("Задача с банком")

    # Начальные условия
    Money, Percent, Up, Month,  = 1000, 2, 0, 0
    Triger_1, Triger_2 = True, True
    Task_1, Task_2 = 0, 0

    # Цикл программы
    while(Money < 1200 or Up < 30):

        # Счёт
        Up = Bank(Money, Percent)
        Money = Money + Up
        Month += 1 

        print("Месяц: ", Month, ";\t Счёт: ", round(Money,2),";\t Увеличение вклада: ", round(Up,2))

        # Сохраняем ключевые месяцы
        if(Money >= 1200 and Triger_1): Task_1 = Month; Triger_1 = False
        if(Up >= 30 and Triger_2):      Task_2 = Month; Triger_2 = False

    # Выводим результат
    print("\nИтог:")
    print("Через ", Task_1, " месяцев величина ежемесячного увеличения вклада превысит 30 рублей")
    print("Через ", Task_2, " месяцев размер вклада превысит 1200 руб")


# -------------------------------------------------------------
if __name__ == "__main__": main()
# -------------------------------------------------------------

